openfoam_libtorch_hfdib_demo/cases/four_port_64/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(

    (-0.016 0 0)
    (-0.016 0 0.002)
    (-0.016 0.016 0)
    (-0.016 0.016 0.002)
    (-0.016 0.032 0)
    (-0.016 0.032 0.002)
    (-0.016 0.096 0)
    (-0.016 0.096 0.002)
    (-0.016 0.112 0)
    (-0.016 0.112 0.002)
    (-0.016 0.128 0)
    (-0.016 0.128 0.002)
    (0 0 0)
    (0 0 0.002)
    (0 0.016 0)
    (0 0.016 0.002)
    (0 0.032 0)
    (0 0.032 0.002)
    (0 0.096 0)
    (0 0.096 0.002)
    (0 0.112 0)
    (0 0.112 0.002)
    (0 0.128 0)
    (0 0.128 0.002)
    (0.128 0 0)
    (0.128 0 0.002)
    (0.128 0.016 0)
    (0.128 0.016 0.002)
    (0.128 0.032 0)
    (0.128 0.032 0.002)
    (0.128 0.096 0)
    (0.128 0.096 0.002)
    (0.128 0.112 0)
    (0.128 0.112 0.002)
    (0.128 0.128 0)
    (0.128 0.128 0.002)
    (0.144 0 0)
    (0.144 0 0.002)
    (0.144 0.016 0)
    (0.144 0.016 0.002)
    (0.144 0.032 0)
    (0.144 0.032 0.002)
    (0.144 0.096 0)
    (0.144 0.096 0.002)
    (0.144 0.112 0)
    (0.144 0.112 0.002)
    (0.144 0.128 0)
    (0.144 0.128 0.002)
);

blocks
(
    hex (12 24 26 14 13 25 27 15) (64 8 1) simpleGrading (1 1 1)
    hex (14 26 28 16 15 27 29 17) (64 8 1) simpleGrading (1 1 1)
    hex (16 28 30 18 17 29 31 19) (64 32 1) simpleGrading (1 1 1)
    hex (18 30 32 20 19 31 33 21) (64 8 1) simpleGrading (1 1 1)
    hex (20 32 34 22 21 33 35 23) (64 8 1) simpleGrading (1 1 1)
    hex (2 14 16 4 3 15 17 5) (8 8 1) simpleGrading (1 1 1)
    hex (6 18 20 8 7 19 21 9) (8 8 1) simpleGrading (1 1 1)
    hex (26 38 40 28 27 39 41 29) (8 8 1) simpleGrading (1 1 1)
    hex (30 42 44 32 31 43 45 33) (8 8 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 4 5 3)
            (6 8 9 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (38 40 41 39)
            (42 44 45 43)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (12 14 15 13)
            (24 26 27 25)
            (12 24 25 13)
            (16 18 19 17)
            (28 30 31 29)
            (20 22 23 21)
            (32 34 35 33)
            (22 34 35 23)
            (2 14 15 3)
            (4 16 17 5)
            (6 18 19 7)
            (8 20 21 9)
            (26 38 39 27)
            (28 40 41 29)
            (30 42 43 31)
            (32 44 45 33)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (

            (12 24 26 14)
            (13 25 27 15)
            (14 26 28 16)
            (15 27 29 17)
            (16 28 30 18)
            (17 29 31 19)
            (18 30 32 20)
            (19 31 33 21)
            (20 32 34 22)
            (21 33 35 23)
            (2 14 16 4)
            (3 15 17 5)
            (6 18 20 8)
            (7 19 21 9)
            (26 38 40 28)
            (27 39 41 29)
            (30 42 44 32)
            (31 43 45 33)
        );
    }
);
