openfoam_libtorch_hfdib_demo/cases/four_port_64/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes      { default         steadyState; }
gradSchemes     { default         Gauss linear; }
divSchemes      { default         Gauss linear; }
laplacianSchemes{ default         Gauss linear uncorrected; }
interpolationSchemes { default    linear; }
snGradSchemes   { default         uncorrected; }
