openfoam_libtorch_hfdib_demo/cases/four_port_64/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers {}
